case_unsteady/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Author: Chen Xiaoxiao                           |
|    \\/     M anipulation  | Website: www.smilemax.top                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }

    ground
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
