case_unsteady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.0001;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
        
        //solver          PBiCGStab;
        //preconditioner  DILU;
        //tolerance       1e-8;
        //relTol          0.001;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }
}


PIMPLE
{
    nNonOrthogonalCorrectors    0;
    nCorrectors                 3;
    nOuterCorrectors            1;
    pRefCell    0;
    pRefValue    0;
}


relaxationFactors
{
    equations
    {
        U                    0.8;
        "(k|epsilon|omega)"  0.8;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
